BrentBaccala/CoCoA/src/tests/test-TmpMorseGraph.C
//   Copyright (c)  2013 Mario Albert

//   This file is part of the source of CoCoALib, the CoCoA Library.

//   CoCoALib is free software: you can redistribute it and/or modify
//   it under the terms of the GNU General Public License as published by
//   the Free Software Foundation, either version 3 of the License, or
//   (at your option) any later version.

//   CoCoALib is distributed in the hope that it will be useful,
//   but WITHOUT ANY WARRANTY; without even the implied warranty of
//   MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
//   GNU General Public License for more details.

//   You should have received a copy of the GNU General Public License
//   along with CoCoALib.  If not, see <http://www.gnu.org/licenses/>.


#include "CoCoA/BuildInfo.H"
#include "CoCoA/GlobalManager.H"
#include "CoCoA/TmpJBEnv.H"
#include "CoCoA/TmpMorseGraph.H"
#include "CoCoA/ideal.H"
#include "CoCoA/library.H"
//#include "CoCoA/assert.H"  // for using TEST_ASSERT
#include "CoCoA/error.H"

using namespace CoCoA;
using namespace std;

// Handy macro for making assertions.
#define TEST_ASSERT(cond)   do { if (!(cond)) CoCoA::AssertionFailed(#cond, __FILE__, __LINE__); } while(0)

void test_myVectorBoolToVectorLong(bool WriteName)
{
  if(WriteName)
  {
    std::cout << "test_myVectorBoolToVectorLong" << std::endl;
  }
  ring Q = RingQQ();
  SparsePolyRing PolyRing = NewPolyRing(Q, SymbolRange("x",0,0), StdDegLex);
  const vector<RingElem> x = indets(PolyRing);
  vector<RingElem> PolInput;
  PolInput.push_back(x[0]);
  JBMill mill = ExtendedJanetBasis(PolInput);
  MorseGraph mg(mill);

  std::vector<bool> bools;
  bools.push_back(false);
  bools.push_back(false);
  bools.push_back(false);
  bools.push_back(false);
  bools.push_back(false);

//   std::vector<long> longs(myVectorBoolToVectorLong(bools));
//   TEST_ASSERT(longs.size() == 0);


//   bools[0] = true;
//   bools[4] = true;
//   longs = myVectorBoolToVectorLong(bools);
//   TEST_ASSERT(longs.size() == 2);
//   TEST_ASSERT(longs[0] == 0);
//   TEST_ASSERT(longs[1] == 4);

//   bools[1] = true;
//   bools[3] = true;
//   longs = myVectorBoolToVectorLong(bools);
//   TEST_ASSERT(longs.size() == 4);
//   TEST_ASSERT(longs[0] == 0);
//   TEST_ASSERT(longs[1] == 1);
//   TEST_ASSERT(longs[2] == 3);
//   TEST_ASSERT(longs[3] == 4);

//   bools[2] = true;
//   longs = myVectorBoolToVectorLong(bools);
//   TEST_ASSERT(longs.size() == 5);
//   TEST_ASSERT(longs[0] == 0);
//   TEST_ASSERT(longs[1] == 1);
//   TEST_ASSERT(longs[2] == 2);
//   TEST_ASSERT(longs[3] == 3);
//   TEST_ASSERT(longs[4] == 4);
}

void test_myVariationWithoutRepetition(bool WriteName)
{
  if(WriteName)
  {
    std::cout << "test_myVariationWithoutRepetition" << std::endl;
  }
  ring Q = RingQQ();
  SparsePolyRing PolyRing = NewPolyRing(Q, SymbolRange("x",0,4), StdDegLex);
  const vector<RingElem> x = indets(PolyRing);
  vector<RingElem> PolInput;
  PolInput.push_back(x[0]);
  PolInput.push_back(x[1]);
  PolInput.push_back(x[2]);
  PolInput.push_back(x[3]);
  PolInput.push_back(x[4]);
  JBMill mill = ExtendedJanetBasis(PolInput);

  
  MorseGraph mg(mill);
  std::vector<std::vector<long> > TestResult;
  std::vector<long> input;
  input.push_back(0);
  input.push_back(1);
  input.push_back(2);
  input.push_back(3);
  input.push_back(4);

  // test with length 0
  mg.myVariationWithoutRepetition(TestResult, std::vector<long>(), input, 0);
  TEST_ASSERT(TestResult.size() == 1);
  TEST_ASSERT(TestResult[0].size() == 0);

  // test with length 6
  TestResult.clear();
  mg.myVariationWithoutRepetition(TestResult, std::vector<long>(), input, 6);
  TEST_ASSERT(TestResult.size() == 0);

  // test with length 1
  TestResult.clear();
  mg.myVariationWithoutRepetition(TestResult, std::vector<long>(), input, 1);
  TEST_ASSERT(TestResult.size() == 5);
  TEST_ASSERT(TestResult[0].size() == 1);
  TEST_ASSERT(TestResult[1].size() == 1);
  TEST_ASSERT(TestResult[2].size() == 1);
  TEST_ASSERT(TestResult[3].size() == 1);
  TEST_ASSERT(TestResult[4].size() == 1);
  TEST_ASSERT(TestResult[0][0] == 0);
  TEST_ASSERT(TestResult[1][0] == 1);
  TEST_ASSERT(TestResult[2][0] == 2);
  TEST_ASSERT(TestResult[3][0] == 3);
  TEST_ASSERT(TestResult[4][0] == 4);

  // test with length 2
  TestResult.clear();
  mg.myVariationWithoutRepetition(TestResult, std::vector<long>(), input, 2);
  TEST_ASSERT(TestResult.size() == 10);
  TEST_ASSERT(TestResult[0].size() == 2);
  TEST_ASSERT(TestResult[1].size() == 2);
  TEST_ASSERT(TestResult[2].size() == 2);
  TEST_ASSERT(TestResult[3].size() == 2);
  TEST_ASSERT(TestResult[4].size() == 2);
  TEST_ASSERT(TestResult[5].size() == 2);
  TEST_ASSERT(TestResult[6].size() == 2);
  TEST_ASSERT(TestResult[7].size() == 2);
  TEST_ASSERT(TestResult[8].size() == 2);
  TEST_ASSERT(TestResult[9].size() == 2);
  TEST_ASSERT(TestResult[0][0] == 0);
  TEST_ASSERT(TestResult[0][1] == 1);
  TEST_ASSERT(TestResult[1][0] == 0);
  TEST_ASSERT(TestResult[1][1] == 2);
  TEST_ASSERT(TestResult[2][0] == 0);
  TEST_ASSERT(TestResult[2][1] == 3);
  TEST_ASSERT(TestResult[3][0] == 0);
  TEST_ASSERT(TestResult[3][1] == 4);
  TEST_ASSERT(TestResult[4][0] == 1);
  TEST_ASSERT(TestResult[4][1] == 2);
  TEST_ASSERT(TestResult[5][0] == 1);
  TEST_ASSERT(TestResult[5][1] == 3);
  TEST_ASSERT(TestResult[6][0] == 1);
  TEST_ASSERT(TestResult[6][1] == 4);
  TEST_ASSERT(TestResult[7][0] == 2);
  TEST_ASSERT(TestResult[7][1] == 3);
  TEST_ASSERT(TestResult[8][0] == 2);
  TEST_ASSERT(TestResult[8][1] == 4);
  TEST_ASSERT(TestResult[9][0] == 3);
  TEST_ASSERT(TestResult[9][1] == 4);
}

void test_myPossibleWedges(bool WriteName)
{
  if(WriteName)
  {
    std::cout << "test_myPossibleWedges" << std::endl;
  }
  ring Q = RingQQ();
  SparsePolyRing PolyRing = NewPolyRing(Q, SymbolRange("x",0,4), StdDegLex);
  const vector<RingElem> x = indets(PolyRing);
  vector<RingElem> PolInput;
  PolInput.push_back(x[0]);
  PolInput.push_back(x[1]);
  PolInput.push_back(x[2]);
  PolInput.push_back(x[3]);
  PolInput.push_back(x[4]);
  JBMill mill = ExtendedJanetBasis(PolInput);

  
  MorseGraph mg(mill);
  std::vector<DynamicBitset> TestResult;
  std::vector<long> input;

  TestResult = mg.myPossibleWedges(input, 0);
  TEST_ASSERT(TestResult.size() == 1);
  TEST_ASSERT(TestResult[0].IamAll0s());


