BrentBaccala/CoCoA/src/tests/test-TmpMorseGraph.C
  input.push_back(0);
  input.push_back(1);
  input.push_back(2);
  TestResult = mg.myPossibleWedges(input, 3);
  TEST_ASSERT(TestResult.size() == 8);
  TEST_ASSERT(TestResult[0].Iam1At(0) == false);
  TEST_ASSERT(TestResult[0].Iam1At(1) == false);
  TEST_ASSERT(TestResult[0].Iam1At(2) == false);

  TEST_ASSERT(TestResult[1].Iam1At(0) == true);
  TEST_ASSERT(TestResult[1].Iam1At(1) == false);
  TEST_ASSERT(TestResult[1].Iam1At(2) == false);

  TEST_ASSERT(TestResult[2].Iam1At(0) == false);
  TEST_ASSERT(TestResult[2].Iam1At(1) == true);
  TEST_ASSERT(TestResult[2].Iam1At(2) == false);

  TEST_ASSERT(TestResult[3].Iam1At(0) == false);
  TEST_ASSERT(TestResult[3].Iam1At(1) == false);
  TEST_ASSERT(TestResult[3].Iam1At(2) == true);

  TEST_ASSERT(TestResult[4].Iam1At(0) == true);
  TEST_ASSERT(TestResult[4].Iam1At(1) == true);
  TEST_ASSERT(TestResult[4].Iam1At(2) == false);

  TEST_ASSERT(TestResult[5].Iam1At(0) == true);
  TEST_ASSERT(TestResult[5].Iam1At(1) == false);
  TEST_ASSERT(TestResult[5].Iam1At(2) == true);

  TEST_ASSERT(TestResult[6].Iam1At(0) == false);
  TEST_ASSERT(TestResult[6].Iam1At(1) == true);
  TEST_ASSERT(TestResult[6].Iam1At(2) == true);

  TEST_ASSERT(TestResult[7].Iam1At(0) == true);
  TEST_ASSERT(TestResult[7].Iam1At(1) == true);
  TEST_ASSERT(TestResult[7].Iam1At(2) == true);


  TestResult = mg.myPossibleWedges(input, 4);
  TEST_ASSERT(TestResult.size() == 8);
  TEST_ASSERT(TestResult[0].Iam1At(0) == false);
  TEST_ASSERT(TestResult[0].Iam1At(1) == false);
  TEST_ASSERT(TestResult[0].Iam1At(2) == false);
  TEST_ASSERT(TestResult[0].Iam1At(3) == false);

  TEST_ASSERT(TestResult[1].Iam1At(0) == true);
  TEST_ASSERT(TestResult[1].Iam1At(1) == false);
  TEST_ASSERT(TestResult[1].Iam1At(2) == false);
  TEST_ASSERT(TestResult[1].Iam1At(3) == false);

  TEST_ASSERT(TestResult[2].Iam1At(0) == false);
  TEST_ASSERT(TestResult[2].Iam1At(1) == true);
  TEST_ASSERT(TestResult[2].Iam1At(2) == false);
  TEST_ASSERT(TestResult[2].Iam1At(3) == false);

  TEST_ASSERT(TestResult[3].Iam1At(0) == false);
  TEST_ASSERT(TestResult[3].Iam1At(1) == false);
  TEST_ASSERT(TestResult[3].Iam1At(2) == true);
  TEST_ASSERT(TestResult[3].Iam1At(3) == false);

  TEST_ASSERT(TestResult[4].Iam1At(0) == true);
  TEST_ASSERT(TestResult[4].Iam1At(1) == true);
  TEST_ASSERT(TestResult[4].Iam1At(2) == false);
  TEST_ASSERT(TestResult[4].Iam1At(3) == false);

  TEST_ASSERT(TestResult[5].Iam1At(0) == true);
  TEST_ASSERT(TestResult[5].Iam1At(1) == false);
  TEST_ASSERT(TestResult[5].Iam1At(2) == true);
  TEST_ASSERT(TestResult[5].Iam1At(3) == false);

  TEST_ASSERT(TestResult[6].Iam1At(0) == false);
  TEST_ASSERT(TestResult[6].Iam1At(1) == true);
  TEST_ASSERT(TestResult[6].Iam1At(2) == true);
  TEST_ASSERT(TestResult[6].Iam1At(3) == false);

  TEST_ASSERT(TestResult[7].Iam1At(0) == true);
  TEST_ASSERT(TestResult[7].Iam1At(1) == true);
  TEST_ASSERT(TestResult[7].Iam1At(2) == true);
  TEST_ASSERT(TestResult[7].Iam1At(3) == false);
}

void test_myComputeGeneralBasis(bool WriteName)
{
  if(WriteName)
  {
    std::cout << "test_myComputeGeneralBasis" << std::endl;
  }
  ring Q = RingQQ();
  SparsePolyRing PolyRing = NewPolyRing(Q, SymbolRange("x",0,1), StdDegLex);
  const vector<RingElem> x = indets(PolyRing);
  vector<RingElem> PolInput;
  PolInput.push_back(x[0]);
  PolInput.push_back(x[1]);
  JBMill mill = ExtendedJanetBasis(PolInput);

  MorseGraph mg(mill);

  std::vector<MorseElement> elems(mg.myComputeGeneralBasis());

  TEST_ASSERT(elems.size() == 3);
  std::vector<std::pair<RingElem, DynamicBitset> > TestBasis;
  TestBasis.push_back(std::pair<RingElem, DynamicBitset>(x[0], DynamicBitset(LPP(x[0] * x[1]))));
  TestBasis.push_back(std::pair<RingElem, DynamicBitset>(x[1], DynamicBitset(LPP(x[1]))));
  TestBasis.push_back(std::pair<RingElem, DynamicBitset>(x[1], DynamicBitset(LPP(x[1]))));
  std::vector<std::pair<RingElem, DynamicBitset> >::iterator TBIter(TestBasis.begin());
  MorseElement m1(DynamicBitset(2), TBIter);
  ++TBIter;
  MorseElement m2(DynamicBitset(2), TBIter);
  ++TBIter;
  MorseElement m3(DynamicBitset(LPP(x[0])), TBIter);
  TEST_ASSERT(elems[0] == m2);
  TEST_ASSERT(elems[1] == m3);
  TEST_ASSERT(elems[2] == m1);
}

 void test_myComputeBasicGraph(bool WriteName)
{
  if(WriteName)
  {
    std::cout << " test_myComputeBasicGraph" << std::endl;
  }
  ring Q = RingQQ();
  SparsePolyRing PolyRing = NewPolyRing(Q, SymbolRange("x",0,1), StdDegLex);
  const vector<RingElem> x = indets(PolyRing);
  vector<RingElem> PolInput;
  PolInput.push_back(x[0]);
  PolInput.push_back(x[1]);
  JBMill mill = ExtendedJanetBasis(PolInput);

  MorseGraph mg(mill);
  StandardRepresentationContainer container(mill);
  mg.myComputeBasicGraph(mg.myComputeGeneralBasis(), container);

  std::map<MorseElement, MorsePaths> res(mg.myGetBasicResolution());

  TEST_ASSERT(res.size() == 4);
  std::vector<std::pair<RingElem, DynamicBitset> > TestBasis;
  TestBasis.push_back(std::pair<RingElem, DynamicBitset>(x[0], DynamicBitset(LPP(x[0] * x[1]))));
  TestBasis.push_back(std::pair<RingElem, DynamicBitset>(x[1], DynamicBitset(LPP(x[1]))));
  TestBasis.push_back(std::pair<RingElem, DynamicBitset>(x[1], DynamicBitset(LPP(x[1]))));
  std::vector<std::pair<RingElem, DynamicBitset> >::iterator TBIter(TestBasis.begin());

  MorseElement m1(DynamicBitset(2), TBIter);
  ++TBIter;
  MorseElement m2(DynamicBitset(2), TBIter);
  ++TBIter;
  MorseElement m3(DynamicBitset(LPP(x[0])), TBIter);
  TBIter = TestBasis.begin();
  MorseElement m4(DynamicBitset(2), LPP(x[1]), TBIter);

  TEST_ASSERT(res.find(m1) != res.end());
  TEST_ASSERT(res.find(m2) != res.end());
  TEST_ASSERT(res.find(m3) != res.end());
  TEST_ASSERT(res.find(m4) != res.end());

  TEST_ASSERT(res[m1].IamEmpty() == true);
  TEST_ASSERT(res[m2].IamEmpty() == false);
  TEST_ASSERT(res[m3].IamEmpty() == true);
  TEST_ASSERT(res[m4].IamEmpty() == false);

  TEST_ASSERT(res[m2].myGetPaths().size() == 1);
  TEST_ASSERT(res[m4].myGetPaths().size() == 1);
}

void test_myDirectMorseReduction1(bool WriteName)
{
  if(WriteName)
  {
    std::cout << "test_myDirectMorseReduction1" << std::endl;
  }
  ring Q = RingQQ();
  SparsePolyRing PolyRing = NewPolyRing(Q, SymbolRange("x",0,1), StdDegLex);
  const vector<RingElem> x = indets(PolyRing);
  vector<RingElem> PolInput;
  PolInput.push_back(x[0]);
  PolInput.push_back(x[1]);
  JBMill mill = ExtendedJanetBasis(PolInput);

  MorseGraph mg(mill);
  mg.myComputeResolution();

