BrentBaccala/CoCoA/src/tests/test-TmpMorseGraph.C
  std::map<MorseElement, MorsePaths> res(mg.myGetBasicResolution());

  TEST_ASSERT(res.size() == 3);
  std::vector<std::pair<RingElem, DynamicBitset> > TestBasis;
  TestBasis.push_back(std::pair<RingElem, DynamicBitset>(x[0], DynamicBitset(LPP(x[0] * x[1]))));
  TestBasis.push_back(std::pair<RingElem, DynamicBitset>(x[1], DynamicBitset(LPP(x[1]))));
  TestBasis.push_back(std::pair<RingElem, DynamicBitset>(x[1], DynamicBitset(LPP(x[1]))));
  std::vector<std::pair<RingElem, DynamicBitset> >::iterator TBIter(TestBasis.begin());

  MorseElement m1(DynamicBitset(2), TBIter);
  ++TBIter;
  MorseElement m2(DynamicBitset(2), TBIter);
  ++TBIter;
  MorseElement m3(DynamicBitset(LPP(x[0])), TBIter);

  TEST_ASSERT(res.find(m1) != res.end());
  TEST_ASSERT(res.find(m2) != res.end());
  TEST_ASSERT(res.find(m3) != res.end());

  TEST_ASSERT(res[m1].IamEmpty() == false);
  TEST_ASSERT(res[m2].IamEmpty() == false);
  TEST_ASSERT(res[m3].IamEmpty() == true);

  TEST_ASSERT(res[m1].myGetPaths().size() == 1);
  TEST_ASSERT(res[m2].myGetPaths().size() == 1);

  TEST_ASSERT(res[m1].myGetPath(res.find(m3)) == -x[1]);
  TEST_ASSERT(res[m2].myGetPath(res.find(m3)) == x[0]);
}

void test_myDirectMorseReduction2(bool WriteName)
{
  if(WriteName)
  {
    std::cout << "test_myDirectMorseReduction2" << std::endl;
  }
  ring Q = RingQQ();
  SparsePolyRing PolyRing = NewPolyRing(Q, SymbolRange("x",0,3), StdDegLex);
  const vector<RingElem> x = indets(PolyRing);
  vector<RingElem> PolInput;
  PolInput.push_back(x[2] + 1);
  PolInput.push_back(x[0] * x[2] * x[3]);
  PolInput.push_back(x[0] + x[1] * x[1]);
  PolInput.push_back(x[1] * x[2] + x[3] * x[1]);

  JBMill mill = ExtendedJanetBasis(PolInput);
  TEST_ASSERT(JBIsPommaretBasis(mill) == true);
  std::vector<RingElem> basis(JBReturnJB(mill));
  MorseGraph mg(mill);
  mg.myComputeResolution();

  std::map<MorseElement, MorsePaths> res(mg.myGetBasicResolution());

  std::vector<std::pair<RingElem, DynamicBitset> > TestBasis;
  TestBasis.push_back(std::pair<RingElem, DynamicBitset>(x[1] * x[3] - x[1], DynamicBitset(LPP(x[3]))));
  TestBasis.push_back(std::pair<RingElem, DynamicBitset>(x[1] * x[2] + x[1], DynamicBitset(LPP(x[3] * x[2]))));
  TestBasis.push_back(std::pair<RingElem, DynamicBitset>(x[1] * x[3] - x[1], DynamicBitset(LPP(x[3]))));
  TestBasis.push_back(std::pair<RingElem, DynamicBitset>(x[1] * x[3] - x[1], DynamicBitset(LPP(x[3]))));
  TestBasis.push_back(std::pair<RingElem, DynamicBitset>(x[1] * x[3] - x[1], DynamicBitset(LPP(x[3]))));
  TestBasis.push_back(std::pair<RingElem, DynamicBitset>(x[2] + 1, DynamicBitset(LPP(x[2] * x[3]))));
  TestBasis.push_back(std::pair<RingElem, DynamicBitset>(x[2] + 1, DynamicBitset(LPP(x[2] * x[3]))));
  TestBasis.push_back(std::pair<RingElem, DynamicBitset>(x[2] + 1, DynamicBitset(LPP(x[2] * x[3]))));
  TestBasis.push_back(std::pair<RingElem, DynamicBitset>(x[1] * x[2] + x[1], DynamicBitset(LPP(x[2] * x[3]))));
  TestBasis.push_back(std::pair<RingElem, DynamicBitset>(x[1] * x[3] - x[1], DynamicBitset(LPP(x[3]))));
  TestBasis.push_back(std::pair<RingElem, DynamicBitset>(x[1] * x[2] + x[1], DynamicBitset(LPP(x[2] * x[3]))));
  TestBasis.push_back(std::pair<RingElem, DynamicBitset>(x[1] * x[3] - x[1], DynamicBitset(LPP(x[3]))));
  TestBasis.push_back(std::pair<RingElem, DynamicBitset>(x[1] * x[3] - x[1], DynamicBitset(LPP(x[3]))));
  TestBasis.push_back(std::pair<RingElem, DynamicBitset>(x[1] * x[1], DynamicBitset(LPP(x[1] * x[2] * x[3]))));
  TestBasis.push_back(std::pair<RingElem, DynamicBitset>(x[1] * x[2] + x[1], DynamicBitset(LPP(x[2] * x[3]))));
  TestBasis.push_back(std::pair<RingElem, DynamicBitset>(x[2] + 1, DynamicBitset(LPP(x[2] * x[3]))));
  TestBasis.push_back(std::pair<RingElem, DynamicBitset>(x[0], DynamicBitset(LPP(x[0] * x[1] * x[2] * x[3]))));
  TestBasis.push_back(std::pair<RingElem, DynamicBitset>(x[1] * x[3] - x[1], DynamicBitset(LPP(x[3]))));
  TestBasis.push_back(std::pair<RingElem, DynamicBitset>(x[1] * x[1], DynamicBitset(LPP(x[1] * x[2] * x[3]))));

  std::vector<std::pair<RingElem, DynamicBitset> >::iterator TBIter(TestBasis.begin());
  MorseElement m1(DynamicBitset(LPP(x[0] * x[1] * x[2])), TBIter);
  ++TBIter;

  MorseElement m2(DynamicBitset(LPP(x[0] * x[1])), TBIter);
  ++TBIter;
  MorseElement m3(DynamicBitset(LPP(x[0] * x[1])), TBIter);
  ++TBIter;
  MorseElement m4(DynamicBitset(LPP(x[0] * x[2])), TBIter);
  ++TBIter;
  MorseElement m5(DynamicBitset(LPP(x[1] * x[2])), TBIter);
  ++TBIter;
  MorseElement m6(DynamicBitset(LPP(x[0] * x[1])), TBIter);
  ++TBIter;

  MorseElement m7(DynamicBitset(LPP(x[1])),  TBIter);
  ++TBIter;
  MorseElement m8(DynamicBitset(LPP(x[0])),  TBIter);
  ++TBIter;
  MorseElement m9(DynamicBitset(LPP(x[0])),  TBIter);
  ++TBIter;
  MorseElement m10(DynamicBitset(LPP(x[2])), TBIter);
  ++TBIter;
  MorseElement m11(DynamicBitset(LPP(x[1])), TBIter);
  ++TBIter;
  MorseElement m12(DynamicBitset(LPP(x[1])), TBIter);
  ++TBIter;
  MorseElement m13(DynamicBitset(LPP(x[0])), TBIter);
  ++TBIter;
  MorseElement m14(DynamicBitset(LPP(x[0])), TBIter);
  ++TBIter;

  MorseElement m15(DynamicBitset(LPP(one(PolyRing))), TBIter);
  ++TBIter;
  MorseElement m16(DynamicBitset(LPP(one(PolyRing))), TBIter);
  ++TBIter;
  MorseElement m17(DynamicBitset(LPP(one(PolyRing))), TBIter);
  ++TBIter;
  MorseElement m18(DynamicBitset(LPP(one(PolyRing))), TBIter);
  ++TBIter;
  MorseElement m19(DynamicBitset(LPP(one(PolyRing))), TBIter);

  TEST_ASSERT(res.find(m1) != res.end());
  TEST_ASSERT(res.find(m2) != res.end());
  TEST_ASSERT(res.find(m3) != res.end());
  TEST_ASSERT(res.find(m4) != res.end());
  TEST_ASSERT(res.find(m5) != res.end());
  TEST_ASSERT(res.find(m6) != res.end());
  TEST_ASSERT(res.find(m7) != res.end());
  TEST_ASSERT(res.find(m8) != res.end());
  TEST_ASSERT(res.find(m9) != res.end());
  TEST_ASSERT(res.find(m10) != res.end());
  TEST_ASSERT(res.find(m11) != res.end());
  TEST_ASSERT(res.find(m12) != res.end());
  TEST_ASSERT(res.find(m13) != res.end());
  TEST_ASSERT(res.find(m14) != res.end());
  TEST_ASSERT(res.find(m15) != res.end());
  TEST_ASSERT(res.find(m16) != res.end());
  TEST_ASSERT(res.find(m17) != res.end());
  TEST_ASSERT(res.find(m18) != res.end());
  TEST_ASSERT(res.find(m19) != res.end());


  TEST_ASSERT(res[m1].myGetPaths().size() == 0);
  TEST_ASSERT(res[m2].myGetPaths().size() == 1);
  TEST_ASSERT(res[m3].myGetPaths().size() == 1);
  TEST_ASSERT(res[m4].myGetPaths().size() == 1);
  TEST_ASSERT(res[m5].myGetPaths().size() == 1);
  TEST_ASSERT(res[m6].myGetPaths().size() == 0);
  TEST_ASSERT(res[m7].myGetPaths().size() == 1);
  TEST_ASSERT(res[m8].myGetPaths().size() == 1);
  TEST_ASSERT(res[m9].myGetPaths().size() == 3);
  TEST_ASSERT(res[m10].myGetPaths().size() == 2);
  TEST_ASSERT(res[m11].myGetPaths().size() == 2);
  TEST_ASSERT(res[m12].myGetPaths().size() == 2);
  TEST_ASSERT(res[m13].myGetPaths().size() == 2);
  TEST_ASSERT(res[m14].myGetPaths().size() == 2);
  TEST_ASSERT(res[m15].myGetPaths().size() == 4);
  TEST_ASSERT(res[m16].myGetPaths().size() == 2);
  TEST_ASSERT(res[m17].myGetPaths().size() == 4);
  TEST_ASSERT(res[m18].myGetPaths().size() == 3);
  TEST_ASSERT(res[m19].myGetPaths().size() == 3);

  //paths from m1
  TEST_ASSERT(res[m2].myGetPath(res.find(m1)) == -x[3] + 1);
  TEST_ASSERT(res[m3].myGetPath(res.find(m1)) == x[2] + 1);
  TEST_ASSERT(res[m4].myGetPath(res.find(m1)) == -x[1]);
  TEST_ASSERT(res[m5].myGetPath(res.find(m1)) == x[0]);

  //paths from m6
  TEST_ASSERT(res[m7].myGetPath(res.find(m6)) == x[0]);
  TEST_ASSERT(res[m8].myGetPath(res.find(m6)) == -x[1]);
  TEST_ASSERT(res[m9].myGetPath(res.find(m6)) == one(PolyRing));

