BrentBaccala/CoCoA/src/tests/test-TmpMorseGraph.C
  //paths from m5
  TEST_ASSERT(res[m10].myGetPath(res.find(m5)) == x[1]);
  TEST_ASSERT(res[m11].myGetPath(res.find(m5)) == x[3] - 1);
  TEST_ASSERT(res[m12].myGetPath(res.find(m5)) == -x[2] - 1);

  //paths from m4
  TEST_ASSERT(res[m10].myGetPath(res.find(m4)) == x[0]);
  TEST_ASSERT(res[m13].myGetPath(res.find(m4)) == - x[2] - 1);
  TEST_ASSERT(res[m9].myGetPath(res.find(m4)) == x[3] - 1);

  //paths from m3
  TEST_ASSERT(res[m12].myGetPath(res.find(m3)) == x[0]);
  TEST_ASSERT(res[m13].myGetPath(res.find(m3)) == - x[1]);
  TEST_ASSERT(res[m14].myGetPath(res.find(m3)) == x[3] - 1);

  //paths from m2
  TEST_ASSERT(res[m11].myGetPath(res.find(m2)) == x[0]);
  TEST_ASSERT(res[m9].myGetPath(res.find(m2)) == - x[1]);
  TEST_ASSERT(res[m14].myGetPath(res.find(m2)) == x[2] + 1);

  //paths from m7
  TEST_ASSERT(res[m15].myGetPath(res.find(m7)) == - 1);
  TEST_ASSERT(res[m16].myGetPath(res.find(m7)) == x[1]);

  //paths from m8
  TEST_ASSERT(res[m16].myGetPath(res.find(m8)) == x[0]);
  TEST_ASSERT(res[m17].myGetPath(res.find(m8)) == - x[2] - 1);

  //paths from m9
  TEST_ASSERT(res[m15].myGetPath(res.find(m9)) == x[0]);
  TEST_ASSERT(res[m17].myGetPath(res.find(m9)) == - x[1] * x[2] - x[1]);

  //paths from m10
  TEST_ASSERT(res[m18].myGetPath(res.find(m10)) == x[2] + 1);
  TEST_ASSERT(res[m15].myGetPath(res.find(m10)) == - x[3] + 1);

  //paths from m11
  TEST_ASSERT(res[m15].myGetPath(res.find(m11)) == x[1]);
  TEST_ASSERT(res[m19].myGetPath(res.find(m11)) == - 1 - x[2]);

  //paths from m12
  TEST_ASSERT(res[m18].myGetPath(res.find(m12)) == x[1]);
  TEST_ASSERT(res[m19].myGetPath(res.find(m12)) == 1 - x[3]);

  //paths from m13
  TEST_ASSERT(res[m18].myGetPath(res.find(m13)) == x[0]);
  TEST_ASSERT(res[m17].myGetPath(res.find(m13)) == x[1] - x[1] * x[3]);

  //paths from m14
  TEST_ASSERT(res[m19].myGetPath(res.find(m14)) == x[0]);
  TEST_ASSERT(res[m17].myGetPath(res.find(m14)) == - x[1] * x[1]);
}


void test_myMapsAsMatrices(bool WriteName)
{
  if(WriteName)
  {
    std::cout << "test_myMapsAsMatrices" << std::endl;
  }
  // using result of syzygys
  // output of matrices is transposed content of syzygys
  ring Q = RingQQ();
  SparsePolyRing PolyRing = NewPolyRing(Q, SymbolRange("x",0,3), StdDegLex);
  const vector<RingElem> x = indets(PolyRing);
  vector<RingElem> PolInput;
  PolInput.push_back(x[2] + 1);
  PolInput.push_back(x[0] * x[2] * x[3]);
  PolInput.push_back(x[0] + x[1] * x[1]);
  PolInput.push_back(x[1] * x[2] + x[3] * x[1]);

  JBMill mill = ExtendedJanetBasis(PolInput);
  TEST_ASSERT(JBIsPommaretBasis(mill) == true);
  std::vector<RingElem> basis(JBReturnJB(mill));
  MorseGraph mg(mill);
  mg.myComputeResolution();

  std::vector<matrix> syzs(mg.myMapsAsMatrices());
  TEST_ASSERT(syzs.size() == 3);
  matrix syz0(syzs[0]);
  matrix syz1(syzs[1]);
  matrix syz2(syzs[2]);
  TEST_ASSERT(NumRows(syz0) == 5 && NumCols(syz0) == 8);
  TEST_ASSERT(NumRows(syz1) == 8 && NumCols(syz1) == 5);
  TEST_ASSERT(NumRows(syz2) == 5 && NumCols(syz2) == 1);
  matrix tsyz0(NewDenseMat(transpose(syz0)));
  matrix tsyz1(NewDenseMat(transpose(syz1)));
  matrix tsyz2(NewDenseMat(transpose(syz2)));
  
  TEST_ASSERT(tsyz0(0, 0) == x[1] && tsyz0(0, 1) == 0                   && tsyz0(0, 2) == 0        && tsyz0(0, 3) == -1         && tsyz0(0, 4) == 0        );
  TEST_ASSERT(tsyz0(1, 0) == x[0] && tsyz0(1, 1) == -x[2] - 1           && tsyz0(1, 2) == 0        && tsyz0(1, 3) == 0          && tsyz0(1, 4) == 0        );
  TEST_ASSERT(tsyz0(2, 0) == 0    && tsyz0(2, 1) == 0                   && tsyz0(2, 2) == x[2] + 1 && tsyz0(2, 3) == -x[3] + 1  && tsyz0(2, 4) == 0        );
  TEST_ASSERT(tsyz0(3, 0) == 0    && tsyz0(3, 1) == 0                   && tsyz0(3, 2) == x[1]     && tsyz0(3, 3) == 0          && tsyz0(3, 4) == -x[3] + 1);
  TEST_ASSERT(tsyz0(4, 0) == 0    && tsyz0(4, 1) == 0                   && tsyz0(4, 2) == 0        && tsyz0(4, 3) == x[1]       && tsyz0(4, 4) == -x[2] - 1);
  TEST_ASSERT(tsyz0(5, 0) == 0    && tsyz0(5, 1) == -x[1] * x[3] + x[1] && tsyz0(5, 2) == x[0]     && tsyz0(5, 3) == 0          && tsyz0(5, 4) == 0        );
  TEST_ASSERT(tsyz0(6, 0) == 0    && tsyz0(6, 1) == -x[1] * x[2] - x[1] && tsyz0(6, 2) == 0        && tsyz0(6, 3) == x[0]       && tsyz0(6, 4) == 0        );
  TEST_ASSERT(tsyz0(7, 0) == 0    && tsyz0(7, 1) == -x[1] * x[1]        && tsyz0(7, 2) == 0        && tsyz0(7, 3) == 0          && tsyz0(7, 4) == x[0]     );

  TEST_ASSERT(tsyz1(0, 0) == x[0]  && tsyz1(0, 1) == -x[1]  && tsyz1(0, 2) == 0    && tsyz1(0, 3) == 0          && tsyz1(0, 4) == 0        && tsyz1(0, 5) == 0          && tsyz1(0, 6) == 1        && tsyz1(0, 7) == 0        );
  TEST_ASSERT(tsyz1(1, 0) == 0     && tsyz1(1, 1) == 0      && tsyz1(1, 2) == x[1] && tsyz1(1, 3) == -x[2] - 1  && tsyz1(1, 4) == x[3] - 1 && tsyz1(1, 5) == 0          && tsyz1(1, 6) == 0        && tsyz1(1, 7) == 0        );
  TEST_ASSERT(tsyz1(2, 0) == 0     && tsyz1(2, 1) == 0      && tsyz1(2, 2) == x[0] && tsyz1(2, 3) == 0          && tsyz1(2, 4) == 0        && tsyz1(2, 5) == -x[2] - 1  && tsyz1(2, 6) == x[3] - 1 && tsyz1(2, 7) == 0        );
  TEST_ASSERT(tsyz1(3, 0) == 0     && tsyz1(3, 1) == 0      && tsyz1(3, 2) == 0    && tsyz1(3, 3) == x[0]       && tsyz1(3, 4) == 0        && tsyz1(3, 5) == -x[1]      && tsyz1(3, 6) == 0        && tsyz1(3, 7) == x[3] - 1 );
  TEST_ASSERT(tsyz1(4, 0) == 0     && tsyz1(4, 1) == 0      && tsyz1(4, 2) == 0    && tsyz1(4, 3) == 0          && tsyz1(4, 4) == x[0]     && tsyz1(4, 5) == 0          && tsyz1(4, 6) == -x[1]     && tsyz1(4, 7) == x[2] + 1);

  TEST_ASSERT(tsyz2(0, 0) == 0 && tsyz2(0, 1) == x[0] && tsyz2(0, 2) == -x[1] && tsyz2(0, 3) == x[2] + 1 && tsyz2(0, 4) == -x[3] + 1);

}

void test_myBettis(bool WriteName)
{
  if(WriteName)
  {
    std::cout << "test_myBettis" << std::endl;
  }
  ring Q = RingQQ();
  SparsePolyRing PolyRing = NewPolyRing(Q, SymbolRange("x",0,4), StdDegLex);
  const vector<RingElem> x = indets(PolyRing);
  vector<RingElem> PolInput;
  PolInput.push_back(x[2] + 1);
  PolInput.push_back(x[0] * x[2] * x[3]);
  PolInput.push_back(x[0] + x[1] * x[1]);
  PolInput.push_back(x[1] * x[2] + x[3] * x[1]);
  ideal I(PolyRing, PolInput);
  I = homog(I, x[4]);
  JBMill mill = ExtendedJanetBasis(gens(I));
  TEST_ASSERT(JBIsHomogenous(mill) == true);
  TEST_ASSERT(JBIsPommaretBasis(mill) == true);
  std::vector<RingElem> basis(JBReturnJB(mill));
  MorseGraph mg(mill);
  matrix bettis(NewDenseMat(RingZZ(), 2, 5));
  SetEntry(bettis, 0, 0, 1);
  SetEntry(bettis, 0, 1, 2);
  SetEntry(bettis, 0, 2, 1);
  SetEntry(bettis, 0, 3, 0);
  SetEntry(bettis, 0, 4, 0);

