BrentBaccala/CoCoA/src/tests/test-TmpMorseGraph.C
  SetEntry(bettis, 1, 0, 0);
  SetEntry(bettis, 1, 1, 2);
  SetEntry(bettis, 1, 2, 5);
  SetEntry(bettis, 1, 3, 4);
  SetEntry(bettis, 1, 4, 1);
  TEST_ASSERT(bettis == mg.myComputeBettiNumbers());
}

void test_onlyX(bool WriteName)
{
  if(WriteName)
  {
    std::cout << "test_onlyX" << std::endl;
  }
  ring Q = RingQQ();
  SparsePolyRing PolyRing = NewPolyRing(Q, SymbolRange("x",0,0), StdDegLex);
  const vector<RingElem> x = indets(PolyRing);
  vector<RingElem> PolInput;
  PolInput.push_back(x[0]);
  JBMill mill = ExtendedJanetBasis(PolInput);
  TEST_ASSERT(JBIsHomogenous(mill) == true);
  TEST_ASSERT(JBIsPommaretBasis(mill) == true);
  std::vector<RingElem> basis(JBReturnJB(mill));
  MorseGraph mg(mill);
  matrix bettis(NewDenseMat(RingZZ(), 1, 2));
  SetEntry(bettis, 0, 0, 1);
  SetEntry(bettis, 0, 1, 1);

  TEST_ASSERT(bettis == mg.myComputeBettiNumbers());
    
}

void test_onlyOne(bool WriteName)
{
  if(WriteName)
  {
    std::cout << "test_onlyOne" << std::endl;
  }
  ring Q = RingQQ();
  SparsePolyRing PolyRing = NewPolyRing(Q, SymbolRange("x",0,0), StdDegLex);
  const vector<RingElem> x = indets(PolyRing);
  vector<RingElem> PolInput;
  PolInput.push_back(one(PolyRing));
  JBMill mill = ExtendedJanetBasis(PolInput);
  TEST_ASSERT(JBIsHomogenous(mill) == true);
  TEST_ASSERT(JBIsPommaretBasis(mill) == true);
  std::vector<RingElem> basis(JBReturnJB(mill));
  MorseGraph mg(mill);
  matrix bettis(NewDenseMat(RingZZ(), 1, 1));

  TEST_ASSERT(bettis == mg.myComputeBettiNumbers());
    
}


void test_chandra4(bool WriteName)
{
  if(WriteName)
  {
    std::cout << "test_chandra4" << std::endl;
  }
  ring Q = RingQQ();

  SparsePolyRing polyRingBenchmark_D1 = NewPolyRing_DMPI(Q,5);
  vector<RingElem> x = indets(polyRingBenchmark_D1);
  vector<RingElem> input;
  input.push_back(  - 51234*power(x[0],2) - 34156*x[0]*x[1] - 25617*x[0]*x[2] + 1497532*x[0] - 1600000);
  input.push_back(- 170780*x[0]*x[1] - 128085*power(x[1],2) - 102468*x[1]*x[2] + 7743830*x[1] - 8000000);
  input.push_back(  - 128085*x[0]*x[2] - 102468*x[1]*x[2] - 85390*power(x[2],2) + 7829220*x[2] - 8000000);
  input.push_back(  - 717276*x[0]*x[3] - 597730*x[1]*x[3] - 512340*x[2]*x[3] + 55103405*x[3] - 56000000);
  ideal I(polyRingBenchmark_D1, input);
  I = homog(I, x[4]);
//ring r = 0,(x0, x1, x2, x3, x4),dp;
//ideal i = - 51234*x0^2 - 34156*x0*x1 - 25617*x0*x2 + 1497532*x0 - 1600000, - 170780*x0*x1 - 128085*x1^2 - 102468*x1*x2 + 7743830*x1 - 8000000, - 128085*x0*x2 - 102468*x1*x2 - 85390*x2^2 + 7829220*x2 - 8000000, - 717276*x0*x3 - 597730*x1*x3 - 512340*x2*x3 + 55103405*x3 - 56000000;
//i = groebner(i);
//i = homog(i, x4);
//i = groebner(i);
//resolution rs = mres(i, 0);
//print(betti(rs), "betti");

  JBMill mill = ExtendedJanetBasis(gens(I));

  TEST_ASSERT(JBIsHomogenous(mill) == true);
  TEST_ASSERT(JBIsPommaretBasis(mill) == true);
  MorseGraph mg(mill);
  
  matrix bettis(NewDenseMat(RingZZ(), 4, 5));
  SetEntry(bettis, 0, 0, 1);
  SetEntry(bettis, 0, 1, 1);
  SetEntry(bettis, 1, 1, 3);
  SetEntry(bettis, 1, 2, 3);
  SetEntry(bettis, 2, 2, 3);
  SetEntry(bettis, 2, 3, 3);
  SetEntry(bettis, 3, 3, 1);
  SetEntry(bettis, 3, 4, 1);

  TEST_ASSERT(bettis == mg.myComputeBettiNumbers());

}


void test_boon(bool WriteName)
{
  if(WriteName)
  {
    std::cout << "test_boon" << std::endl;
  }
  ring Q = RingQQ();
  SparsePolyRing polyRing = NewPolyRing_DMPI(Q,7);
  vector<RingElem> x = indets(polyRing);
  vector<RingElem> input;

  input.push_back(power(x[2],2) + power(x[4],2) - 1);
  input.push_back( power(x[3],2) + power(x[5],2) - 1);
  input.push_back(5*x[0]*power(x[2],3) + 5*x[1]*power(x[3],3) - 6);
  input.push_back( 5*x[0]*power(x[4],3) + 5*x[1]*power(x[5],3) - 6);
  input.push_back(      10*x[0]*power(x[2],2)*x[4] + 10*x[1]*power(x[3],2)*x[5] - 7);
  input.push_back(      10*x[0]*x[2]*power(x[4],2) + 10*x[1]*x[3]*power(x[5],2) - 7);

  // ring r = 0,(x0, x1, x2, x3, x4, x5, x6),dp;
  // ideal i = x2^2 + x4^2 - 1, x3^2 + x5^2 - 1, 5*x0*x2^3 + 5*x1*x3^3 - 6, 5*x0*x4^3 + 5*x1*x5^3 - 6, 10*x0*x2^2*x4 + 10*x1*x3^2*x5 - 7, 10*x0*x2*x4^2 + 10*x1*x3*x5^2 - 7;
  // i = groebner(i);
  // i = homog(i, x6);
  // i = groebner(i);
  // resolution rs = mres(i, 0);
  // print(betti(rs), "betti");

  input = JanetBasis(input);
  for (std::vector<RingElem>::iterator i = input.begin(); i != input.end(); ++i)
  {
    *i = homog(*i, x[6]);
  }
  JBMill mill = ExtendedJanetBasis(input);

  TEST_ASSERT(JBIsHomogenous(mill) == true);
  TEST_ASSERT(JBIsPommaretBasis(mill) == true);

  MorseGraph mg(mill);
  matrix myBettis(NewDenseMat(mg.myComputeBettiNumbers()));
  matrix bettis(NewDenseMat(RingZZ(), 3, 7));
  SetEntry(bettis, 0, 0, 1);
  SetEntry(bettis, 0, 1, 2);
  SetEntry(bettis, 0, 2, 1);
  SetEntry(bettis, 1, 1, 7);
  SetEntry(bettis, 1, 2, 22);
  SetEntry(bettis, 1, 3, 26);
  SetEntry(bettis, 1, 4, 14);
  SetEntry(bettis, 1, 5, 3);
  SetEntry(bettis, 2, 2, 6);
  SetEntry(bettis, 2, 3, 20);
  SetEntry(bettis, 2, 4, 25);
  SetEntry(bettis, 2, 5, 14);
  SetEntry(bettis, 2, 6, 3);
  TEST_ASSERT(bettis == myBettis);
}


void test_caprasse(bool WriteName)
{
  if(WriteName)
  {
    std::cout << "test_caprasse" << std::endl;
  }
  ring Q = RingQQ();
  SparsePolyRing polyRing = NewPolyRing_DMPI(Q,5);
  vector<RingElem> x = indets(polyRing);
  vector<RingElem> input;

  input.push_back(    2*x[3]*x[0]*x[1] - 2*x[0] + power(x[1],2)*x[2] - x[2]);
  input.push_back(  4*x[3]*power(x[0],2)*x[1] + 2*x[3]*power(x[1],3) - 10*x[3]*x[1] - power(x[0],3)*x[2] + 4*power(x[0],2) + 4*x[0]*power(x[1],2)*x[2] + 4*x[0]*x[2] - 10*power(x[1],2) + 2);
  input.push_back(      power(x[3],2)*x[0] + 2*x[3]*x[1]*x[2] - x[0] - 2*x[2]);
  input.push_back(      2*power(x[3],3)*x[1] + 4*power(x[3],2)*x[0]*x[2] - 10*power(x[3],2) + 4*x[3]*x[1]*power(x[2],2) - 10*x[3]*x[1] - x[0]*power(x[2],3) + 4*x[0]*x[2] + 4*power(x[2],2) + 2);

  // ring r = 0,(x0, x1, x2, x3, x4),dp;
  // ideal i = 2*x3*x0*x1 - 2*x0 + x1^2*x2 - x2, 4*x3*x0^2*x1 + 2*x3*x1^3 - 10*x3*x1 - x0^3*x2 + 4*x0^2 + 4*x0*x1^2*x2 + 4*x0*x2 - 10*x1^2 + 2, x3^2*x0 + 2*x3*x1*x2 - x0 - 2*x2, 2*x3^3*x1 + 4*x3^2*x0*x2 - 10*x3^2 + 4*x3*x1*x2^2 - 10*x3*x1 - x0*x2^3 + 4*x0*x2 + 4*x2^2 + 2;
  // i = groebner(i);
  // i = homog(i, x4);
  // i = groebner(i);
  // resolution rs = mres(i, 0);
  // print(betti(rs), "betti");

  input = JanetBasis(input);
  for (std::vector<RingElem>::iterator i = input.begin(); i != input.end(); ++i)
  {
    *i = homog(*i, x[4]);
  }
  JBMill mill = ExtendedJanetBasis(input);
  TEST_ASSERT(JBIsHomogenous(mill) == true);
  TEST_ASSERT(JBIsPommaretBasis(mill) == true);
  MorseGraph mg(mill);
  matrix myBettis(NewDenseMat(mg.myComputeBettiNumbers()));

  matrix bettis(NewDenseMat(RingZZ(), 7, 5));
  SetEntry(bettis, 0, 0, 1);
  SetEntry(bettis, 2, 1, 2);
  SetEntry(bettis, 3, 1, 12);
  SetEntry(bettis, 3, 2, 18);
  SetEntry(bettis, 3, 3, 7);
  SetEntry(bettis, 4, 2, 13);
  SetEntry(bettis, 4, 3, 16);
  SetEntry(bettis, 4, 4, 6);
  SetEntry(bettis, 5, 2, 2);
  SetEntry(bettis, 5, 3, 3);
  SetEntry(bettis, 6, 3, 2);
  SetEntry(bettis, 6, 4, 2);
  
  TEST_ASSERT(myBettis == bettis);
}


void test_cassou(bool WriteName)
{
  if(WriteName)
  {
    std::cout << "test_cassou" << std::endl;
  }
  ring Q = RingQQ();
  SparsePolyRing polyRing = NewPolyRing_DMPI(Q,5);
  vector<RingElem> x = indets(polyRing);
  vector<RingElem> input;
  input.push_back(    6*power(x[0],4)*power(x[1],3) + 21*power(x[0],4)*power(x[1],2)*x[2] + 15*power(x[0],4)*x[1]*power(x[2],2) + 9*power(x[0],4)*power(x[2],3) - 8*power(x[0],2)*power(x[1],2)*x[3] - 28*power(x[0],2)*x[1]*x[2]*x[3] - 144*power(x[0],2)*x[1] + 36*power(x[0],2)*power(x[2],2)*x[3] - 648*power(x[0],2)*x[2] - 120);
  input.push_back(  9*power(x[0],4)*power(x[1],4) + 30*power(x[0],4)*power(x[1],3)*x[2] + 39*power(x[0],4)*power(x[1],2)*power(x[2],2) + 18*power(x[0],4)*x[1]*power(x[2],3) - 24*power(x[0],2)*power(x[1],3)*x[3] - 16*power(x[0],2)*power(x[1],2)*x[2]*x[3] - 432*power(x[0],2)*power(x[1],2) + 16*power(x[0],2)*x[1]*power(x[2],2)*x[3] - 720*power(x[0],2)*x[1]*x[2] + 24*power(x[0],2)*power(x[2],3)*x[3] - 432*power(x[0],2)*power(x[2],2) + 16*power(x[1],2)*power(x[3],2) - 32*x[1]*x[2]*power(x[3],2) + 576*x[1]*x[3] - 240*x[1] + 16*power(x[2],2)*power(x[3],2) - 576*x[2]*x[3] + 5184);
  input.push_back(      - 15*power(x[0],2)*power(x[1],3)*x[3] + 15*power(x[0],2)*power(x[1],2)*x[2]*x[3] - 81*power(x[0],2)*power(x[1],2) + 216*power(x[0],2)*x[1]*x[2] - 162*power(x[0],2)*power(x[2],2) + 40*power(x[1],2)*power(x[3],2) - 80*x[1]*x[2]*power(x[3],2) + 1008*x[1]*x[3] + 40*power(x[2],2)*power(x[3],2) - 1008*x[2]*x[3] + 5184);
  input.push_back(- 4*power(x[0],2)*power(x[1],2) + 4*power(x[0],2)*x[1]*x[2] - 3*power(x[0],2)*power(x[2],2) + 22*x[1]*x[3] - 22*x[2]*x[3] + 261);

