BrentBaccala/CoCoA/src/tests/test-TmpMorseGraph.C
  // ring r = 0,(x0, x1, x2, x3, x4),dp;
  // ideal i = 6*x0^4*x1^3 + 21*x0^4*x1^2*x2 + 15*x0^4*x1*x2^2 + 9*x0^4*x2^3 - 8*x0^2*x1^2*x3 - 28*x0^2*x1*x2*x3 - 144*x0^2*x1 + 36*x0^2*x2^2*x3 - 648*x0^2*x2 - 120, 9*x0^4*x1^4 + 30*x0^4*x1^3*x2 + 39*x0^4*x1^2*x2^2 + 18*x0^4*x1*x2^3 - 24*x0^2*x1^3*x3 - 16*x0^2*x1^2*x2*x3 - 432*x0^2*x1^2 + 16*x0^2*x1*x2^2*x3 - 720*x0^2*x1*x2 + 24*x0^2*x2^3*x3 - 432*x0^2*x2^2 + 16*x1^2*x3^2 - 32*x1*x2*x3^2 + 576*x1*x3 - 240*x1 + 16*x2^2*x3^2 - 576*x2*x3 + 5184, - 15*x0^2*x1^3*x3 + 15*x0^2*x1^2*x2*x3 - 81*x0^2*x1^2 + 216*x0^2*x1*x2 - 162*x0^2*x2^2 + 40*x1^2*x3^2 - 80*x1*x2*x3^2 + 1008*x1*x3 + 40*x2^2*x3^2 - 1008*x2*x3 + 5184, - 4*x0^2*x1^2 + 4*x0^2*x1*x2 - 3*x0^2*x2^2 + 22*x1*x3 - 22*x2*x3 + 261;
  // i = groebner(i);
  // i = homog(i, x4);
  // i = groebner(i);
  // resolution rs = mres(i, 0);
  // print(betti(rs), "betti");

  input = JanetBasis(input);
  for (std::vector<RingElem>::iterator i = input.begin(); i != input.end(); ++i)
  {
    *i = homog(*i, x[4]);
  }
  JBMill mill = ExtendedJanetBasis(input);

  TEST_ASSERT(JBIsHomogenous(mill) == true);
  TEST_ASSERT(JBIsPommaretBasis(mill) == true);

  MorseGraph mg(mill);
  matrix myBettis(NewDenseMat(mg.myComputeBettiNumbers()));
  matrix bettis(NewDenseMat(RingZZ(), 4, 5));
  SetEntry(bettis, 0, 0, 1);
  SetEntry(bettis, 1, 1, 3);
  SetEntry(bettis, 2, 1, 4);
  SetEntry(bettis, 2, 2, 11);
  SetEntry(bettis, 2, 3, 4);
  SetEntry(bettis, 3, 2, 4);
  SetEntry(bettis, 3, 3, 9);
  SetEntry(bettis, 3, 4, 4);
  TEST_ASSERT(myBettis == bettis);

}

void test_conform1(bool WriteName)
{
  if(WriteName)
  {
    std::cout << "test_conform1" << std::endl;
  }
  ring Q = RingQQ();
  SparsePolyRing polyRing = NewPolyRing_DMPI(Q,4);
  vector<RingElem> x = indets(polyRing);
  vector<RingElem> input;

  input.push_back(  - 3*power(x[1],2)*power(x[2],2) - power(x[1],2) + 8*x[1]*x[2] - power(x[2],2) - 9);
  input.push_back(  - 3*power(x[0],2)*power(x[2],2) - power(x[0],2) + 8*x[0]*x[2] - power(x[2],2) - 9);
  input.push_back(  - 3*power(x[0],2)*power(x[1],2) - power(x[0],2) + 8*x[0]*x[1] - power(x[1],2) - 9);

  // ring r = 0,(x0, x1, x2, x3),dp;
  // ideal i = - 3*x1^2*x2^2 - x1^2 + 8*x1*x2 - x2^2 - 9, - 3*x0^2*x2^2 - x0^2 + 8*x0*x2 - x2^2 - 9, - 3*x0^2*x1^2 - x0^2 + 8*x0*x1 - x1^2 - 9;
  // i = groebner(i);
  // i = homog(i, x3);
  // i = groebner(i);
  // resolution rs = mres(i, 0);
  // print(betti(rs), "betti");

  input = JanetBasis(input);
  for (std::vector<RingElem>::iterator i = input.begin(); i != input.end(); ++i)
  {
    *i = homog(*i, x[3]);
  }
  JBMill mill = ExtendedJanetBasis(input);

  TEST_ASSERT(JBIsHomogenous(mill) == true);
  TEST_ASSERT(JBIsPommaretBasis(mill) == true);

  MorseGraph mg(mill);
  matrix myBettis(NewDenseMat(mg.myComputeBettiNumbers()));
  matrix bettis(NewDenseMat(RingZZ(), 5, 4));
  SetEntry(bettis, 0, 0, 1);
  SetEntry(bettis, 2, 1, 5);
  SetEntry(bettis, 2, 2, 2);
  SetEntry(bettis, 3, 1, 1);
  SetEntry(bettis, 3, 2, 6);
  SetEntry(bettis, 3, 3, 2);
  SetEntry(bettis, 4, 3, 1);
  TEST_ASSERT(myBettis == bettis);
}


void test_lorentz(bool WriteName)
{
  if(WriteName)
  {
    std::cout << "test_lorentz" << std::endl;
  }
  ring Q = RingQQ();
  SparsePolyRing polyRing = NewPolyRing_DMPI(Q,5);
  vector<RingElem> x = indets(polyRing);
  vector<RingElem> input;

  input.push_back(  x[1-1]*x[2-1] - x[1-1]*x[3-1] - x[4-1] + 1);
  input.push_back(  - x[1-1] + x[2-1]*x[3-1] - x[2-1]*x[4-1] + 1);
  input.push_back(  - x[1-1]*x[3-1] - x[2-1] + x[3-1]*x[4-1] + 1);
  input.push_back(  x[1-1]*x[4-1] - x[2-1]*x[4-1] - x[3-1] + 1);

  // ring r = 0,(x0, x1, x2, x3, x4),dp;
  // ideal i = x0*x1 - x0*x2 - x3 + 1, - x0 + x1*x2 - x1*x3 + 1, - x0*x2 - x1 + x2*x3 + 1, x0*x3 - x1*x3 - x2 + 1;
  // i = groebner(i);
  // i = homog(i, x4);
  // i = groebner(i);
  // resolution rs = mres(i, 0);
  // print(betti(rs), "betti");

  input = JanetBasis(input);
  for (std::vector<RingElem>::iterator i = input.begin(); i != input.end(); ++i)
  {
    *i = homog(*i, x[4]);
  }
  JBMill mill = ExtendedJanetBasis(input);

  TEST_ASSERT(JBIsHomogenous(mill) == true);
  TEST_ASSERT(JBIsPommaretBasis(mill) == true);

  MorseGraph mg(mill);
  matrix myBettis(NewDenseMat(mg.myComputeBettiNumbers()));
  matrix bettis(NewDenseMat(RingZZ(), 4, 5));
  SetEntry(bettis, 0, 0, 1);
  SetEntry(bettis, 1, 1, 5);
  SetEntry(bettis, 1, 2, 1);
  SetEntry(bettis, 2, 2, 11);
  SetEntry(bettis, 2, 3, 10);
  SetEntry(bettis, 2, 4, 1);
  SetEntry(bettis, 3, 4, 1);
  TEST_ASSERT(myBettis == bettis);
}

void test_mickey(bool WriteName)
{
  if(WriteName)
  {
    std::cout << "test_mickey" << std::endl;
  }
  ring Q = RingQQ();
  SparsePolyRing polyRing = NewPolyRing_DMPI(Q,3);
  vector<RingElem> x = indets(polyRing);
  vector<RingElem> input;
  input.push_back(   power(x[0],2)+ 4*power(x[1],2) - 4);
  input.push_back(   - x[0]+2*power(x[1],2));

  // ring r = 0,(x0, x1, x2),dp;
  // ideal i =x0^2+ 4*x1^2 - 4, - x0+2*x1^2;
  // i = groebner(i);
  // i = homog(i, x2);
  // i = groebner(i);
  // resolution rs = mres(i, 0);
  // print(betti(rs), "betti");


  input = JanetBasis(input);
  for (std::vector<RingElem>::iterator i = input.begin(); i != input.end(); ++i)
  {
    *i = homog(*i, x[2]);
  }
  JBMill mill = ExtendedJanetBasis(input);

  TEST_ASSERT(JBIsHomogenous(mill) == true);
  TEST_ASSERT(JBIsPommaretBasis(mill) == true);

  MorseGraph mg(mill);
  matrix myBettis(NewDenseMat(mg.myComputeBettiNumbers()));
  matrix bettis(NewDenseMat(RingZZ(), 3, 3));
  SetEntry(bettis, 0, 0, 1);
  SetEntry(bettis, 1, 1, 2);
  SetEntry(bettis, 2, 2, 1);
  TEST_ASSERT(bettis == myBettis);
}

void test_lorentz_min_res(bool WriteName)
{
  if(WriteName)
  {
    std::cout << "test_lorentz_min_res" << std::endl;
  }
  ring Q = RingQQ();
  SparsePolyRing polyRing = NewPolyRing_DMPI(Q,5);
  vector<RingElem> x = indets(polyRing);
  vector<RingElem> input;
  input.push_back(  x[1-1]*x[2-1] - x[1-1]*x[3-1] - x[4-1] + 1);
  input.push_back(  - x[1-1] + x[2-1]*x[3-1] - x[2-1]*x[4-1] + 1);
  input.push_back(  - x[1-1]*x[3-1] - x[2-1] + x[3-1]*x[4-1] + 1);
  input.push_back(  x[1-1]*x[4-1] - x[2-1]*x[4-1] - x[3-1] + 1);

