BrentBaccala/CoCoA/src/tests/test-TmpMorseGraph.C
  // ring r = 0,(x0, x1, x2, x3, x4),dp;
  // ideal i = x0*x1 - x0*x2 - x3 + 1, - x0 + x1*x2 - x1*x3 + 1, - x0*x2 - x1 + x2*x3 + 1, x0*x3 - x1*x3 - x2 + 1;
  // i = groebner(i);
  // i = homog(i, x4);
  // i = groebner(i);
  // resolution rs = mres(i, 0);
  // print(betti(rs), "betti");

  input = JanetBasis(input);
  for (std::vector<RingElem>::iterator i = input.begin(); i != input.end(); ++i)
  {
    *i = homog(*i, x[4]);
  }
  JBMill mill = ExtendedJanetBasis(input);

  TEST_ASSERT(JBIsHomogenous(mill) == true);
  TEST_ASSERT(JBIsPommaretBasis(mill) == true);

  MorseGraph mg(mill);
  std::vector<matrix> maps(mg.myComputeMinimalResolution());
  
  matrix m = maps[0] * maps[1];
  for (long i = 0; i < NumRows(m); ++i)
  {
    for (long j = 0; j < NumCols(m); ++j)
    {
      TEST_ASSERT(IsZero(m(i,j)));
    }
  }
  m = maps[1] * maps[2];
  for (long i = 0; i < NumRows(m); ++i)
  {
    for (long j = 0; j < NumCols(m); ++j)
    {
      TEST_ASSERT(IsZero(m(i,j)));
    }
  }
  m = maps[2] * maps[3];
  for (long i = 0; i < NumRows(m); ++i)
  {
    for (long j = 0; j < NumCols(m); ++j)
    {
      TEST_ASSERT(IsZero(m(i,j)));
    }
  }
}


void test_lorentz_res(bool WriteName)
{
  if(WriteName)
  {
    std::cout << "test_lorentz_res" << std::endl;
  }
  ring Q = RingQQ();
  SparsePolyRing polyRing = NewPolyRing_DMPI(Q,5);
  vector<RingElem> x = indets(polyRing);
  vector<RingElem> input;
  input.push_back(  x[1-1]*x[2-1] - x[1-1]*x[3-1] - x[4-1] + 1);
  input.push_back(  - x[1-1] + x[2-1]*x[3-1] - x[2-1]*x[4-1] + 1);
  input.push_back(  - x[1-1]*x[3-1] - x[2-1] + x[3-1]*x[4-1] + 1);
  input.push_back(  x[1-1]*x[4-1] - x[2-1]*x[4-1] - x[3-1] + 1);

  // ring r = 0,(x0, x1, x2, x3, x4),dp;
  // ideal i = x0*x1 - x0*x2 - x3 + 1, - x0 + x1*x2 - x1*x3 + 1, - x0*x2 - x1 + x2*x3 + 1, x0*x3 - x1*x3 - x2 + 1;
  // i = groebner(i);
  // i = homog(i, x4);
  // i = groebner(i);
  // resolution rs = mres(i, 0);
  // print(betti(rs), "betti");
  // 
  // R = QQ[x0, x1, x2, x3, x4]
  // I = ideal(x0*x1 - x0*x2 - x3 + 1, - x0 + x1*x2 - x1*x3 + 1, - x0*x2 - x1 + x2*x3 + 1, x0*x3 - x1*x3 - x2 + 1)
  // I = homogenize(I, x4)
  // C = res(I)
  // betti C
  input = JanetBasis(input);
  for (std::vector<RingElem>::iterator i = input.begin(); i != input.end(); ++i)
  {
    *i = homog(*i, x[4]);
  }
  JBMill mill = ExtendedJanetBasis(input);

  TEST_ASSERT(JBIsHomogenous(mill) == true);
  TEST_ASSERT(JBIsPommaretBasis(mill) == true);

  MorseGraph mg(mill);
  mg.myComputeResolution();
  std::vector<matrix> maps(mg.myGetResolution());
  
  matrix m = maps[0] * maps[1];
  for (long i = 0; i < NumRows(m); ++i)
  {
    for (long j = 0; j < NumCols(m); ++j)
    {
      TEST_ASSERT(IsZero(m(i,j)));
    }
  }
  m = maps[1] * maps[2];
  for (long i = 0; i < NumRows(m); ++i)
  {
    for (long j = 0; j < NumCols(m); ++j)
    {
      TEST_ASSERT(IsZero(m(i,j)));
    }
  }
  m = maps[2] * maps[3];
  for (long i = 0; i < NumRows(m); ++i)
  {
    for (long j = 0; j < NumCols(m); ++j)
    {
      TEST_ASSERT(IsZero(m(i,j)));
    }
  }
}


void test_anna(bool WriteName)
{
  if(WriteName)
  {
    std::cout << "test_anna" << std::endl;
  }
  ring Q = RingQQ();
  SparsePolyRing polyRing = NewPolyRing_DMPI(Q,3);
  vector<RingElem> x = indets(polyRing);
  vector<RingElem> input;
  input.push_back(x[0]);
  input.push_back(x[1]);
  input.push_back(x[2] * x[2]);

  JBMill mill = ExtendedJanetBasis(input);

  TEST_ASSERT(JBIsHomogenous(mill) == true);
  TEST_ASSERT(JBIsPommaretBasis(mill) == true);

  MorseGraph mg(mill);
  std::vector<matrix> maps(mg.myComputeMinimalResolution());
  TEST_ASSERT(maps[0](0,0) == x[1]);
  TEST_ASSERT(maps[0](0,1) == x[0]);
  TEST_ASSERT(maps[0](0,2) == x[2] * x[2]);

  TEST_ASSERT(maps[1](0,0) == x[0]);
  TEST_ASSERT(maps[1](0,1) == -x[2] * x[2]);
  TEST_ASSERT(maps[1](0,2) == 0);
  TEST_ASSERT(maps[1](1,0) == -x[1]);
  TEST_ASSERT(maps[1](1,1) == 0);
  TEST_ASSERT(maps[1](1,2) == - x[2] * x[2]);
  TEST_ASSERT(maps[1](2,0) == 0);
  TEST_ASSERT(maps[1](2,1) == x[1]);
  TEST_ASSERT(maps[1](2,2) == x[0]);

  TEST_ASSERT(maps[2](0,0) == x[2] * x[2]);
  TEST_ASSERT(maps[2](1,0) == x[0]);
  TEST_ASSERT(maps[2](2,0) == -x[1]);
}



void program()
{
  GlobalManager CoCoAFoundations;
  bool WriteName(false);
  test_myVectorBoolToVectorLong(WriteName);
  test_myVariationWithoutRepetition(WriteName);
  test_myPossibleWedges(WriteName);
  test_myComputeGeneralBasis(WriteName);
  test_myComputeBasicGraph(WriteName);
  test_myDirectMorseReduction1(WriteName);
  test_myDirectMorseReduction2(WriteName);
  test_myMapsAsMatrices(WriteName);
  test_myBettis(WriteName);
  test_onlyX(WriteName);
  test_onlyOne(WriteName);
  test_chandra4(WriteName);
  test_cassou(WriteName);
  test_boon(WriteName);
  test_caprasse(WriteName);
  test_conform1(WriteName);
  test_lorentz(WriteName);
  test_mickey(WriteName);
  test_lorentz_min_res(WriteName);
  test_lorentz_res(WriteName);
  test_anna(WriteName);
}



// Use main() to handle any uncaught exceptions and warn the user about them.
int main()
{
  try
  {
    program();
    return 0;
  }
  catch (const CoCoA::ErrorInfo& err)
  {
    cerr << "***ERROR***  UNCAUGHT CoCoA Error";
    ANNOUNCE(cerr, err);
  }
  catch (const std::exception& exc)
  {
    cerr << "***ERROR***  UNCAUGHT std::exception: " << exc.what() << endl;
  }
  catch(...)
  {
    cerr << "***ERROR***  UNCAUGHT UNKNOWN EXCEPTION" << endl;
  }

  BuildInfo::PrintAll(cerr);
  return 1;
}
